src/cf/Enums/СостоянияБанковскихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияБанковскихДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПодписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ПомощникиПоУплатеНалоговИВзносовКлиентСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Проверяет документ уплаты на состояние ошибки.
//
// Параметры:
//  Состояние - ПеречислениеСсылка.СостоянияБанковскихДокументов - состояние документа
//
// Возвращаемое значение:
//  Булево - Истина, если документ с состоянием ошибки.
Функция СостояниеОшибки(Состояние) Экспорт
	
	Возврат Состояние = ПредопределенноеЗначение("Перечисление.СостоянияБанковскихДокументов.Отклонено");
	
КонецФункции

// Проверяет документ уплаты на состояние успешной отправки.
//
// Параметры:
//  Состояние - ПеречислениеСсылка.СостоянияБанковскихДокументов - состояние документа
//
// Возвращаемое значение:
//  Булево - Истина, если документ успешно отправлен.
Функция СостояниеУспешнойОтправки(Состояние) Экспорт
	
	Возврат Состояние = ПредопределенноеЗначение("Перечисление.СостоянияБанковскихДокументов.Отправлено");
	
КонецФункции

// Проверяет документ уплаты на состояние оплаты.
//
// Параметры:
//  Состояние - ПеречислениеСсылка.СостоянияБанковскихДокументов - состояние документа
//
// Возвращаемое значение:
//  Булево - Истина, если документ оплачен.
Функция СостояниеОплачено(Состояние) Экспорт
	
	Возврат Состояние = ПредопределенноеЗначение("Перечисление.СостоянияБанковскихДокументов.Оплачено");
	
КонецФункции

#КонецОбласти
